<?php
defined('_JEXEC') or die();

$config = [
	'с 2016 года выпуска' => [
		'type' => 'benzin',
		'motors' => [
			'ВАЗ-21129 (1.6 16V), ВАЗ-21179 (1.8 16V)' => [
				'type' => 'benzin',
				'model'  => 'Lada XRay',
				'motor'  => '1.6/1.8 16V',
				'years'  => 'с 2016',
				'freq'   => 15000,
				'th'     => 'ВАЗ-21129 (1.6 16V)<br> ВАЗ-21179 (1.8 16V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня ГРМ',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена ремня привода вспомогательных агрегатов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/1585-tekhnicheskoe-obsluzhivanie-lada-xray-15000-km-to-1-1-6-i-1-8-s-2015',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/1586-tekhnicheskoe-obsluzhivanie-lada-xray-30000-km-to-2-1-6-i-1-8-s-2015',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/1587-tekhnicheskoe-obsluzhivanie-lada-xray-45000-km-to-3-1-6-i-1-8-s-2015',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/1588-tekhnicheskoe-obsluzhivanie-lada-xray-60000-km-to-4-1-6-i-1-8-s-2015',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/1589-tekhnicheskoe-obsluzhivanie-lada-xray-75000-km-to-5-1-6-i-1-8-s-2015',
						'type'     => 'oil-liq'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/1590-tekhnicheskoe-obsluzhivanie-lada-xray-90000-km-to-6-1-6-i-1-8-s-2015',
						'type'     => 'oil-ign-grm'
					],
				]
			],
			'H4M (1.6 16V)' => [
				'type' => 'benzin',
				'model'  => 'Lada XRay',
				'motor'  => '1.6 16V',
				'years'  => 'с 2016',
				'freq'   => 15000,
				'th'     => 'H4M (1.6 16V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня привода вспомогательных агрегатов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/2797-tekhnicheskoe-obsluzhivanie-lada-xray-15000-km-to-1-1-6-i-1-8-s-2015',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/2798-tekhnicheskoe-obsluzhivanie-lada-xray-30000-km-to-2-1-6-i-1-8-s-2015',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/2855-tekhnicheskoe-obsluzhivanie-lada-xray-55000-km-to-3-1-6-i-1-8-s-2015',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/2858-tekhnicheskoe-obsluzhivanie-lada-xray-60000-km-to-4-1-6-i-1-8-s-2015',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/2856-tekhnicheskoe-obsluzhivanie-lada-xray-75000-km-to-5-1-6-i-1-8-s-2015',
						'type'     => 'oil-liq'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/2799-tekhnicheskoe-obsluzhivanie-lada-xray-30000-km-to-2-1-6-i-1-8-s-2015',
						'type'     => 'oil-ign'
					],
				]
			],
		],
	],
];
