<?php
defined('_JEXEC') or die();

$config = [
	'Lada Granta FL с 2018 года выпуска' => [
		'type' => 'benzin',
		'motors' => [
			'ВАЗ-11182 (1.6 8V)' => [
				'type' => 'benzin',
				'model'  => 'Lada Granta FL',
				'motor'  => '1.6 8V',
				'years'  => 'с 2020',
				'freq'   => 15000,
				'th'     => 'ВАЗ-11182 (1.6 8V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня ГРМ',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/7162-tekhnicheskoe-obsluzhivanie-lada-granta-15000-km',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/7164-tekhnicheskoe-obsluzhivanie-lada-granta-30000-km',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/7165-tekhnicheskoe-obsluzhivanie-lada-granta-45000-km',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/7166-tekhnicheskoe-obsluzhivanie-lada-granta-60000-km',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/7167-tekhnicheskoe-obsluzhivanie-lada-granta-75000-km',
						'type'     => 'oil-liq'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/7168-tekhnicheskoe-obsluzhivanie-lada-granta-90000-km',
						'type'     => 'oil-ign'
					],
				]
			],
			'ВАЗ-11186 (1.6 8V)' => [
				'type' => 'benzin',
				'model'  => 'Lada Granta FL',
				'motor'  => '1.6 8V',
				'years'  => 'с 2018',
				'freq'   => 15000,
				'th'     => 'ВАЗ-11186 (1.6 8V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена топливного фильтра',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня ГРМ',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена ремня привода вспомогательных агрегатов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена высоковольтных проводов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Регулировка зазоров клапанов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/4098-tekhnicheskoe-obsluzhivanie-lada-granta-fl-15000-km-to-1-1-6-8v-2wd-s-2018',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/4101-tekhnicheskoe-obsluzhivanie-lada-granta-fl-30000-km-to-2-1-6-8v-2wd-s-2018',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/4099-tekhnicheskoe-obsluzhivanie-lada-granta-fl-45000-km-to-3-1-6-8v-2wd-s-2018',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/4102-tekhnicheskoe-obsluzhivanie-lada-granta-fl-60000-km-to-4-1-6-8v-2wd-s-2018',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/4100-tekhnicheskoe-obsluzhivanie-lada-granta-fl-75000-km-to-5-1-6-8v-2wd-s-2018',
						'type'     => 'oil'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/4103-tekhnicheskoe-obsluzhivanie-lada-granta-fl-90000-km-to-6-1-6-8v-2wd-s-2018',
						'type'     => 'oil-ign-grm-liq'
					],
				]
			],
			'ВАЗ-21129 (1.6 16V)' => [
				'type' => 'benzin',
				'model'  => 'Lada Granta FL',
				'motor'  => '1.6 16V',
				'years'  => 'с 2018',
				'freq'   => 15000,
				'th'     => 'ВАЗ-21129 (1.6 16V)<br>ВАЗ-21179 (1.8 16V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня ГРМ',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена ремня привода вспомогательных агрегатов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/4092-tekhnicheskoe-obsluzhivanie-lada-granta-fl-15000-km-to-1-1-6-1-8-16v-2wd-s-2018',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/4093-tekhnicheskoe-obsluzhivanie-granta-fl-30000-km-to-2-1-6-1-8-16v-2wd-s-2018',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/4094-tekhnicheskoe-obsluzhivanie-granta-fl-45000-km-to-3-1-6-1-8-16v-2wd-s-2018',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/4097-tekhnicheskoe-obsluzhivanie-lada-granta-fl-60000-km-to-4-1-6-1-8-16v-2wd-s-2018',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/4095-tekhnicheskoe-obsluzhivanie-granta-fl-75000-km-to-5-1-6-1-8-16v-2wd-s-2018',
						'type'     => 'oil'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/4096-tekhnicheskoe-obsluzhivanie-granta-fl-90000-km-to-6-1-6-1-8-16v-2wd-s-2018',
						'type'     => 'oil-ign-grm-liq'
					],
				]
			],
		],
	],
];
