<?php
defined('_JEXEC') or die();

$config = [
	'Lada Vesta (2015-2022 года выпуска)' => [
		'type' => 'benzin',
		'motors' => [
			'ВАЗ-21129 (1.6 16V), ВАЗ-21179 (1.8 16V)' => [
				'type' => 'benzin',
				'model'  => 'Lada Vesta',
				'motor'  => '1.6/1.8 16V',
				'years'  => 'с 2015',
				'freq'   => 15000,
				'th'     => 'ВАЗ-21129 (1.6 16V)<br> ВАЗ-21179 (1.8 16V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня ГРМ',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена ремня привода вспомогательных агрегатов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/1311-tekhnicheskoe-obsluzhivanie-vesta-sedan-15000-km',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/1312-tekhnicheskoe-obsluzhivanie-lada-vesta-30000-km-to-2-1-6-i-1-8-s-2015',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/1313-tekhnicheskoe-obsluzhivanie-vesta-sedan-45000-km',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/1314-tekhnicheskoe-obsluzhivanie-vesta-sedan-60000-km',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/1315-tekhnicheskoe-obsluzhivanie-vesta-sedan-75000-km',
						'type'     => 'oil'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/1316-tekhnicheskoe-obsluzhivanie-vesta-sedan-90000-km',
						'type'     => 'oil-ign-grm-liq'
					],
				]
			],
			'H4M (1.6 16V)' => [
				'type' => 'benzin',
				'model'  => 'Lada Vesta',
				'motor'  => '1.6 16V',
				'years'  => 'с 2019',
				'freq'   => 15000,
				'th'     => 'H4M (1.6 16V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня привода вспомогательных агрегатов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/4658-tekhnicheskoe-obsluzhivanie-lada-vesta-15000-km-to-1-h4m-1-6-16v-s-2019',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/4659-tekhnicheskoe-obsluzhivanie-lada-vesta-30000-km-to-2-h4m-1-6-16v-s-2019',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/4660-tekhnicheskoe-obsluzhivanie-lada-vesta-45000-km-to-3-h4m-1-6-16v-s-2019',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/4661-tekhnicheskoe-obsluzhivanie-lada-vesta-60000-km-to-4-h4m-1-6-16v-s-2019',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/4662-tekhnicheskoe-obsluzhivanie-lada-vesta-75000-km-to-5-h4m-1-6-16v-s-2019',
						'type'     => 'oil'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/4663-tekhnicheskoe-obsluzhivanie-lada-vesta-90000-km-to-6-h4m-1-6-16v-s-2019',
						'type'     => 'oil-ign-liq'
					],
				]
			],
		],
	],
	'Lada Vesta NG (с 2023 года выпуска)' => [
		'type' => 'benzin',
		'motors' => [
			'ВАЗ-11182 (1.6 8V)' => [
				'type' => 'benzin',
				'model'  => 'Lada Vesta NG',
				'motor'  => '1.6 8V',
				'years'  => 'с 2023',
				'freq'   => 15000,
				'th'     => 'ВАЗ-11182 (1.6 8V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня ГРМ (с ремнем привода ГРМ производства АО "БРТ")',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена фильтра тонкой очистки топлива',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '-',
					],
					[
						'name' => 'Замена высоковольтных проводов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена прокладки клапанной крышки, регулировочные шайбы клапанов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '-',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/7250-tekhnicheskoe-obsluzhivanie-lada-vesta-15000km',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/7251-tekhnicheskoe-obsluzhivanie-lada-vesta-30000km',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/7252-tekhnicheskoe-obsluzhivanie-lada-vesta-45000km',
						'type'     => 'oil-grm'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/7253-tekhnicheskoe-obsluzhivanie-lada-vesta-60000km',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/7254-tekhnicheskoe-obsluzhivanie-lada-vesta-75000km',
						'type'     => 'oil'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/7255-tekhnicheskoe-obsluzhivanie-lada-vesta-90000km',
						'type'     => 'oil-ign-grm-liq'
					],
				]
			],
			'H4M (1.6 16V)' => [
				'type' => 'benzin',
				'model'  => 'Lada Vesta NG',
				'motor'  => '1.6 16V',
				'years'  => 'с 2023',
				'freq'   => 15000,
				'th'     => 'H4M (1.6 16V)',
				'operations' => [
					[
						'name' => 'Замена масла в двигателе и масляного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена воздушного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена салонного фильтра',
						'15000' => '+',
						'30000' => '+',
						'45000' => '+',
						'60000' => '+',
						'75000' => '+',
						'90000' => '+',
					],
					[
						'name' => 'Замена свечей зажигания',
						'15000' => '-',
						'30000' => '+',
						'45000' => '-',
						'60000' => '+',
						'75000' => '-',
						'90000' => '+',
					],
					[
						'name' => 'Замена тормозной жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '+',
						'60000' => '-',
						'75000' => '-',
						'90000' => '-',
					],
					[
						'name' => 'Замена охлаждающей жидкости',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '+',
						'90000' => '-',
					],
					[
						'name' => 'Замена ремня привода вспомогательных агрегатов',
						'15000' => '-',
						'30000' => '-',
						'45000' => '_',
						'60000' => '-',
						'75000' => '-',
						'90000' => '+',
					],
				],
				'links'  => [
					[
						'milage' => 15000,
						'tdHref'   => '/maintenance/item/7256-tekhnicheskoe-obsluzhivanie-lada-vesta-15000km',
						'type'     => 'oil'
					],
					[
						'milage' => 30000,
						'tdHref'   => '/maintenance/item/7257-tekhnicheskoe-obsluzhivanie-lada-vesta-30000km',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 45000,
						'tdHref'   => '/maintenance/item/7258-tekhnicheskoe-obsluzhivanie-lada-vesta-45000km',
						'type'     => 'oil'
					],
					[
						'milage' => 60000,
						'tdHref'   => '/maintenance/item/7259-tekhnicheskoe-obsluzhivanie-lada-vesta-60000km',
						'type'     => 'oil-ign'
					],
					[
						'milage' => 75000,
						'tdHref'   => '/maintenance/item/7260-tekhnicheskoe-obsluzhivanie-lada-vesta-75000km',
						'type'     => 'oil'
					],
					[
						'milage' => 90000,
						'tdHref'   => '/maintenance/item/7261-tekhnicheskoe-obsluzhivanie-lada-vesta-90000km',
						'type'     => 'oil-ign-liq'
					],
				]
			],
		],
	],
];
