
<div class="uk-panel uk-panel-box uk-margin-large-top">
    <h2 id="h2" class="uk-text-center">Регламент технического обслуживания Lada Vesta</h2>
</div>

<div class="uk-overflow-container">
    <table class="uk-table">
        <thead>
        <tr>
            <th>Операция ТО</th>
            <th class="uk-text-center">15000 км<br />ТО-1</th>
            <th class="uk-text-center">30000 км<br />ТО-2</th>
            <th class="uk-text-center">45000 км<br />ТО-3</th>
            <th class="uk-text-center">60000 км<br />ТО-4</th>
            <th class="uk-text-center">75000 км<br />ТО-5</th>
            <th class="uk-text-center">90000 км<br />ТО-6</th>
        </tr>
        </thead>
        <tbody>
            <tr>
                <td>Замена масла в двигателе и масляного фильтра</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">+</td>
            </tr>
            <tr>
                <td>Замена воздушного фильтра</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
            </tr>
            <tr>
                <td>Замена салонного фильтра</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
            </tr>
            <tr>
                <td>Замена свечей зажигания</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
            </tr>
            <tr>
                <td>Замена тормозной жидкости</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
            </tr>
            <tr>
                <td>Замена охлаждающей жидкости</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
            </tr>
            <tr>
                <td>Замена ремня привода вспомогательных агрегатов</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">-</td>
                <td class="uk-text-center">+</td>
            </tr>
            <tr>
                <td>Замена ремня ГРМ</td>
                <td colspan="6" class="uk-text-center">Замена ремня ГРМ производится при пробеге 180000 км</td>
            </tr>
        </tbody>
    </table>
</div>

<div class="uk-panel uk-panel-box uk-margin-large-top">
    <h2 id="h3" class="uk-text-center">Проверочные операции каждые 15000 км</h2>
</div>
<h3>Проверки двигателя</h3>
<ul>
    <li>Проверка отсутствия посторонних шумов при работе двигателя;</li>
    <li>Проверка отсутствия утечек моторного масла через уплотнители, сальники двигателя;</li>
    <li>Проверка работоспособности системы управления двигателем (при наличии кодов ошибок);</li>
    <li>Проверка состояния ремня привода вспомогательных агрегатов;</li>
    <li>Проверка герметичности выхлопной системы и состояния подвески глушителя;</li>
    <li>Проверка состояния и степени натяжения ремня ГРМ;</li>
    <li>Проверка отсутствия утечек охлаждающей жидкости;
    <li>Проверка состояния шлангов и радиатора системы охлаждения двигателя;</li>
    <li>Проверка уровеня охлаждающей жидкости в бачке;</li>
    <li>Проверка герметичности топливных трубопроводов и шлангов;</li>
    <li>Проверка степени затяжки опор двигателя;</li>
</ul>
<h3>Проверки ходовой части</h3>
<ul>
    <li>Проверка отсутствия стуков, скрипов в передней и задней подвесках при движении по неровностям;</li>
    <li>Проверка состояние деталей передней и задней подвески.</li>
</ul>
<h3>Проверки трансмиссии</h3>
<ul>
    <li>Проверка отсутствия посторонних звуков при включении и выключении сцепления (для МКПП);</li>
    <li>Проверка четкости переключения передач и отсутствия посторонних шумов при работе коробки передач;</li>
    <li>Проверка отсутствия посторонних шумов в шарнирах приводов передних колес при движении по прямой и в поворотах;</li>
    <li>Проверка уровня масла в коробке передач;</li>
    <li>Проверка состояния защитных чехлов привода переключения передач;</li>
    <li>Проверка состояния защитных чехлов шарниров приводов передних колес.</li>
</ul>
<h3>Проверки рулевого управления</h3>
<ul>
    <li>Проверка величины люфта в рулевом управлении;</li>
    <li>Проверка состояния пыльников рулевых тяг и рулевой рейки;</li>
    <li>Проверка углов установки колес;</li>
    <li>Проверка исправности электроусилителя руля;</li>
</ul>
<h3>Проверки тормозной системы</h3>
<ul>
    <li>Проверка уровня тормозной жидкости;</li>
    <li>Проверка отсутствия утечки тормозной жидкости;</li>
    <li>Проверка состояния шлангов и трубок тормозной системы;</li>
    <li>Проверка и при необходимости регулировка положения выключателя сигналов торможения;</li>
    <li>Проверка работы стояночного тормоза;</li>
    <li>Проверка эффективности тормозов;</li>
    <li>Проверка работы вакуумного усилителя тормозов;</li>
    <li>Проверка степени износа передних и задних тормозных колодок.</li>
</ul>
<h3>Проверки электрооборудования</h3>
<ul>
    <li>Проверка уровеня и плотность электролита в аккумуляторе;</li>
    <li>Проверка исправности генератора;</li>
    <li>Проверка работы стеклоочистителей;</li>
    <li>Проверка исправности обогрева заднего стекла;</li>
    <li>Проверка исправности подогрева сидений;</li>
    <li>Проверка работы электростеклоподъемников и электроприводов боковых зеркал;</li>
    <li>Проверка исправности ламп освещения, световой сигнализации и звукового сигнала;</li>
    <li>Проверка работы электрокорректора фар;</li>
    <li>Проверка и при необходимости регулировка свет фар;</li>
    <li>Проверка исправности климатической установки (кондиционера).</li>
</ul>
<h3>Проверки элементов кузова</h3>
<ul>
    <li>Проверка исправности замков дверей;</li>
    <li>Прочистка дренажных отверстий в дверях и порогах;</li>
    <li>Смазка петель и ограничителей открывания дверей.</li>
</ul>
<div class="uk-panel uk-panel-box uk-margin-large-top">
    <h2 id="h4" class="uk-text-center">Проверочные операции каждые 30000 км</h2>
</div>
<p>Выполнение всех операций при пробеге каждых 15000 км, а также:</p>
<ul>
    <li>Проверка состояния шин и колесных дисков;</li>
    <li>Проверка и при необходимости балансировка колес.</li>
</ul>
<div class="uk-panel uk-panel-box uk-margin-large-top">
    <h2 id="h5" class="uk-text-center">Проверочные операции каждые 45000 км</h2>
</div>
<p>Выполнение всех операций при пробеге каждых 15000 км, а также:</p>
<ul>
    <li>Смазка троса привода замка капота.</li>
</ul>
